#sepuencing:კოდი თანმიმდევრობით სრულდება
#interation:გამეორება/ციკლი
#selection:არჩევნის გაკეთება,რაღაც პირობის მიხედვით

# For ციკლი გამოიყენება მაშინ, როდესაც გვინდა კოდი რამდენჯერმე შესრულდეს.

# მაგალითად range() ფუნქცია ქმნის რიცხვების დიაპაზონს.
# For ციკლი თითოეულ რიცხვს რიგრიგობით იღებს და ასრულებს კოდს.

# მაგალითად:
# for i in range(5):
#     print(i)

# აქ ციკლი 5ჯერ შესრულდება და გამოიტანს 0,1,2,3,4


for i in range(1, 1001):
    print(i)




for i in range(15):
    print("ხაჭაპური")




family = ["დედა", "მამა", "და", "ძმა"]

for name in family:
    for i in range(5):
        print(name)

