set-{} არეული რიგი
list[] დალაგებული რიგი


set_arr = {1,2,3,4,5}
set_arr.add(6)
set_arr.remove(1)
print(set_arr)



arr = [1, 2, 3, 4, 5] #List

tuple_arr = (1, 2, 3, 4, 5) #Tuple



#Data type
#List
#Integer
#string
#Tuple
#Set
#float
#Boolean

# Set_arr = {1, 2, 3, 4, 5} #Set
# Set_arr2 = {4, 5, 6, 7, 8, 9, 10}

# Set_arr.add(6)
# Set_arr.remove(3)

# combinedSet = Set_arr.union(Set_arr2)
# unique = Set_arr.difference(Set_arr2)
# print(unique)


#Setში არის მხოლოდ უნიკალური ელემენტები, ამიტომ 2 და 5 ორჯერ არ ჩაიწერება.
#.add() ფუნქცია setის ბოლოში ახალ ელემენტს ამატებს
#.remove() ფუნქცია setიდან ამოიღებს არგუმენტად მიღებულ ელემენტს
#.clear() ფუქნცია setიდან ყველა ელემენტს შლის
#.union() ფუნქცია ორი set-ის გაერთიანებულ ელემენტებს აბრუნებს
#.difference() ფუნქცია პირველ set-ში არსებულ, მაგრამ მეორე set-ში არმონაცემ ელემენტებს აბრუნებს
# 0) კომენტარებით ახსენით რა არის განსხვავება set და list შორის
# 1) შექმენით setი, რომელშიც შეინახავთ თქვენს სასურველ რიცხვებს, შემდეგ გამოიყენეთ .add და .remove ფუნქცია

#ლისთი არის დალაგებული კოლექცია, რომელიც შეიძლება შეიცავდეს ფუპლიკატ ელემენტებს, ხოლო სეტი არის დაულაგებელი, რაც ნიშნავს რომ ყველა ელემენტი არის უნიკალური

# numbers = {10, 27, 50, 67, 80, 83}
# numbers.add(90)
# numbers.remove(67)
# print(numbers)

Students = {
    "name" : "john",
    "age" : 21,
    "grade" : "95/100",
    "Friends" : {
        "Friend1" : "Alice",
        "Friend2" : "Bob"
    }
}


John = Students.items()
print(John)
#გასაღები(key) შეიძლება იყოს ნებისმიერ immutable მონაცემთა ტიპი
#მნიშვნელობა(value) შეიძლება იყოს ნებისმიერ მონაცემთა ტიპი

#.keys() ფუნქცია აბრუნებს dictionary-ის ყველა გასაღებს
#.values() ფუნქცია აბრუნებს dictionary-ის ყველა მნიშვნელობას
#.get() ფუნქციას გადაეცემა არგუმენტად გასაღები და გვიბრუნებს შესაბამის მნიშვნელობას
#.items() ფუნქცია აბრუნებს dictionary-ის ყველა წყვილს (key-value) ტუპლედ



i = {
    "name":"giorgi"
    "age":12
    "Friends" : {
        "Friend1" : "gio",
        "Friend2" : "vaxo"
    }
}



#.add() ფუნქცია setის ბოლოში ახალ ელემენტს ამატებს
#.remove() ფუნქცია setიდან ამოიღებს არგუმენტად მიღებულ ელემენტს
#.clear() ფუქნცია setიდან ყველა ელემენტს შლის
#.union() ფუნქცია ორი set-ის გაერთიანებულ ელემენტებს აბრუნებს
#.difference() ფუნქცია პირველ set-ში არსებულ, მაგრამ მეორე set-ში არმონაცემ ელემენტებს აბრუნებს





